app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Tendies 101"], ["room_number", 101], ["created_at", "2020-07-19 20:25:33.060146"], ["updated_at", "2020-07-19 20:25:33.060146"]]
---
  def create
    school_class = SchoolClass.create(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 1]]
---
  def destroy
    @school_class = SchoolClass.find(params[:id])
    @school_class.destroy