app/controllers/students_controller.rb

  def create
    student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["created_at", "2020-07-20 15:27:25.618119"], ["updated_at", "2020-07-20 15:27:25.618119"]]